{
  "backend/main.mo": "Main Motoko actor defining user profile management and basketball player sign-up logic, with role-based access control restricting admin-only endpoints like viewing all sign-ups.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features — disabling the Guard position on the sign-up form and updating the HeroSection stats bar — to their respective source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing their roles in the Blue Panthers basketball sign-up app.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML entry point for the Blue Panthers Sign-Up app, mounting the React app at the `#root` div.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with two routes: `/` for the public sign-up page and `/owner` for the admin dashboard.",
  "frontend/src/components/HeroSection.tsx": "Hero banner component displaying the Blue Panthers branding, location, and a stats bar that marks Forward and Center as open while showing Guard as unavailable with strikethrough styling.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper providing a sticky navy header with team branding, a main content slot, and a branded footer with a hidden link to the owner dashboard.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using TanStack Query, reinitializing it when the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, wrapping DFINITY's AuthClient to expose login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for submitting a player sign-up form (`useSubmitSignUp`) and fetching all sign-ups (`useGetAllSignUps`) via the backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Barlow fonts, sets up Tailwind layers, and defines a deep-navy/gold CSS custom property theme for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/OwnerDashboard.tsx": "Owner-only dashboard page that displays all player sign-ups in a table with position and experience badges, requiring Internet Identity login to access.",
  "frontend/src/pages/SignUpPage.tsx": "Public sign-up page with a react-hook-form form allowing players to register their name, contact info, position, and experience level, showing a success card on submission.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters from both standard and hash-based routes, with helpers to persist values in sessionStorage and remove sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining dark mode, custom color palettes (navy, gold, semantic tokens via oklch), custom fonts (Barlow/Barlow Condensed), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for the Blue Panthers Sign-Up website, recording existing features (marking Guard position as unavailable on SignUpPage and HeroSection) and a pending feature request to display Guard as not available site-wide."
}