{
  "backend/main.mo": "Main actor for the Blue Panthers sign-up app; handles user profiles, position-based sign-up submission with capacity validation (guard: 1, forward/center: 2), and admin queries with access control.",
  "backend/migration.mo": "Migration module that overrides the stored positionConfig to enforce correct max capacities (forward: 2, center: 2, guard: 1) on upgrade.",
  "feature_evidence.json": "Feature evidence report linking the HeroSection stats bar guard-capacity update (1 slot, singular) to its implementation file and test requirement REQ-2.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files for build planning reference.",
  "frontend/index.css": "Global CSS with Tailwind directives and OKLCH-based CSS custom properties for light and dark color themes.",
  "frontend/index.html": "HTML entry point with the page title 'Blue Panthers – NCAA Sign-Up' and a meta description for the basketball team registration app.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with two routes: '/' for SignUpPage inside Layout, and '/owner' for OwnerDashboard.",
  "frontend/src/components/HeroSection.tsx": "Hero banner component with a stats bar that displays position availability, showing '1 Slot Open' (singular) for Guard using GUARD_MAX_CAPACITY and '2 Slots Open' for Forward and Center.",
  "frontend/src/components/Layout.tsx": "Full-page layout wrapper with a sticky navy header displaying the Blue Panthers logo and 'League. maine' subtitle, plus a branded footer.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using TanStack Query, reinitializing when the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state and persisting identity via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting player sign-ups and fetching all sign-ups from the backend canister actor.",
  "frontend/src/index.css": "Global CSS file that imports Barlow fonts, sets up Tailwind directives, and defines a navy/gold dark theme via CSS custom properties.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/OwnerDashboard.tsx": "Owner-only dashboard page that displays all player sign-ups in a styled table with position and experience labels, including login/logout controls.",
  "frontend/src/pages/SignUpPage.tsx": "Public sign-up page with a form for players to register their name, contact info, position, and experience level, with capacity-aware validation and success feedback.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom fonts (Barlow/Barlow Condensed), oklch-based color palettes (navy, gold, semantic tokens), dark mode support, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current project state (version 3) for a basketball sign-up app, recording existing features and pending action requests related to changing the Guard position's max capacity from 2 to 1 in both frontend and backend."
}