{
  "backend/main.mo": "Main Motoko actor implementing the Blue Panthers sign-up backend with user profile management, position-based sign-up submission with capacity validation, and access-controlled queries for retrieving sign-ups.",
  "feature_evidence.json": "Feature evidence report mapping the protected '/signups' page feature to its implementing files (App.tsx, Layout.tsx, SignUpsPage.tsx) and related components, with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing their roles in the Blue Panthers sign-up app UI.",
  "frontend/index.css": "Global CSS file setting up Tailwind base styles and defining CSS custom properties for light and dark color themes using OKLCH values.",
  "frontend/index.html": "HTML entry point for the Blue Panthers NCAA Sign-Up app, loading the React app via main.tsx and setting the page title and meta description.",
  "frontend/src/App.tsx": "Root React component defining four TanStack Router routes: '/' (SignUpPage), '/signups' (SignUpsPage), '/owner' (OwnerDashboard), and '/admin' (AdminPage).",
  "frontend/src/components/HeroSection.tsx": "Hero banner component displaying the Blue Panthers branding, location, and a stats bar showing position slot availability using capacity constants from useQueries.",
  "frontend/src/components/Layout.tsx": "Sticky-header layout wrapper with navigation links including 'Sign-Ups' (visible to all) and a conditional 'Admin' link for authenticated admins, plus a branded footer.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state and persisting identity across page reloads using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting player sign-ups, fetching all sign-ups, and checking if the caller is an admin via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Barlow fonts, sets up Tailwind CSS, and defines a navy/gold design token theme for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin page that displays all player sign-ups in a styled table with login/logout controls, accessible only to authenticated admin users.",
  "frontend/src/pages/OwnerDashboard.tsx": "Owner dashboard page that lists all player sign-ups in a table, with authentication controls and a refresh button, intended for the canister owner.",
  "frontend/src/pages/SignUpPage.tsx": "Public sign-up page with a form for players to register their name, contact info, position, and experience level, with capacity validation and a success confirmation state.",
  "frontend/src/pages/SignUpsPage.tsx": "A protected React page that displays a table of all Blue Panthers sign-ups, requiring Internet Identity authentication; unauthenticated users see a sign-in prompt instead of the list.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with helpers to persist/retrieve values via sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom navy and gold color palettes using OKLCH, custom display/body font families, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for the Blue Panthers sign-up app, tracking existing features, pending architectural requests, and notes about the admin page being protected behind Internet Identity authentication."
}