{
  "backend/main.mo": "Main Motoko actor implementing sign-up submission, user profile management, position capacity validation (max 2 per position), and admin/user access control with authorization mixin.",
  "backend/migration.mo": "Migration module that updates all basketball positions (forward, center, guard) to a max capacity of 2 during canister upgrade.",
  "feature_evidence.json": "Feature evidence report linking the HeroSection stats bar '2 slots' update to HeroSection.tsx with high confidence and test ID REQ-2.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing their roles in the Blue Panthers NCAA sign-up app.",
  "frontend/index.css": "Global CSS file setting up Tailwind base styles and defining OKLCH-based CSS custom properties for light and dark color themes.",
  "frontend/index.html": "HTML entry point for the Blue Panthers NCAA Sign-Up app, setting the page title, meta description, and mounting the React root.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with two routes: '/' for SignUpPage inside Layout and '/owner' for OwnerDashboard.",
  "frontend/src/components/HeroSection.tsx": "Hero banner component displaying team branding and a stats bar that shows each position (Forward, Center, Guard) with '2 Slots Open' or 'Full' based on a max capacity of 2.",
  "frontend/src/components/Layout.tsx": "Full-page layout wrapper providing a sticky navy header with the Blue Panthers logo and 'League. maine' subtitle, a main content area, and a branded footer.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, wrapping DFINITY's AuthClient to expose login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting player sign-ups and fetching all sign-ups from the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Barlow fonts, sets up Tailwind directives, and defines a navy/gold dark-themed CSS variable design system for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/OwnerDashboard.tsx": "Owner-only dashboard page that displays all player sign-ups in a table with position and experience labels, supporting login/logout via Internet Identity.",
  "frontend/src/pages/SignUpPage.tsx": "Public sign-up page with a form for players to register their name, contact info, position, and experience level, with backend error handling for capacity limits.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining dark mode, custom color palettes (navy, gold, semantic tokens via oklch), custom fonts (Barlow), and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current state of the 'Blue Panthers Sign-Up' fantasy sports app project, including existing features, pending feature requests (notably updating position slot capacity to 2), and project metadata."
}