{
  "kind": "build_request",
  "title": "Display Guard position as not available on the sign-up page",
  "projectName": "Blue Panthers Sign-Up",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the public sign-up page (SignUpPage.tsx), mark the 'Guard' position as unavailable: disable the Guard option in the position selector, display a visible 'Not Available' label or badge next to it, and prevent users from submitting the form with Guard selected.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make on the website that that guard is not available"
        ]
      },
      "acceptanceCriteria": [
        "The Guard option in the position dropdown/selector is visually marked as 'Not Available' (e.g., greyed out with a badge or label).",
        "The Guard option is disabled and cannot be selected by the user.",
        "If a user somehow has Guard selected, form submission is blocked with a clear message indicating the position is unavailable.",
        "All other positions remain selectable and unaffected."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the HeroSection stats bar (HeroSection.tsx) to reflect that the Guard position is currently unavailable, so that the public-facing branding is consistent with the sign-up form restriction.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make on the website that that guard is not available"
        ]
      },
      "acceptanceCriteria": [
        "The stats bar or positions display in the hero section shows Guard as 'Unavailable' or 'Closed'.",
        "Other open positions are still shown as available."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Do not change the backend data model or stored sign-up records."
  ],
  "nonGoals": [
    "Adding a backend flag or admin toggle for position availability.",
    "Removing the Guard position permanently from the codebase.",
    "Changing any other position's availability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}