{
  "kind": "build_request",
  "title": "Protected sign-up viewer page requiring authentication",
  "projectName": "Blue Panthers Sign-Up",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a dedicated protected page (e.g., '/signups') that displays the list of all players who have signed up for Blue Panthers. The page must require the user to be signed in via Internet Identity before the sign-up list is shown. If the user is not authenticated, display a prompt to sign in rather than the list.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make a page on the app that you have to sign in to see who signed up for blue panthers"
        ]
      },
      "acceptanceCriteria": [
        "A new route (e.g., '/signups') is registered in App.tsx and accessible via navigation.",
        "Unauthenticated users see a sign-in prompt instead of the sign-up list.",
        "Authenticated users see a table of all Blue Panthers sign-up entries fetched from the backend.",
        "The page includes login and logout controls consistent with the rest of the app's design.",
        "The page is reachable via a navigation link in the app header or menu."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expose or reuse the existing backend query that returns all sign-ups so the new protected page can fetch the full list of sign-ups for authenticated callers. Ensure the query is accessible to any authenticated user (not only admins) if that is the intended access level, or confirm it remains admin-gated.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make a page on the app that you have to sign in to see who signed up for blue panthers"
        ]
      },
      "acceptanceCriteria": [
        "The backend exposes a query that authenticated callers can use to retrieve all sign-up records.",
        "Unauthenticated (anonymous) callers receive an error or empty result from this query.",
        "The existing admin-gated query is not broken by any changes."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All Motoko logic must remain in the single backend/main.mo actor."
  ],
  "nonGoals": [
    "Changing or replacing the existing AdminPage.",
    "Adding filtering or sorting to the new page (not requested).",
    "Implementing a new authentication mechanism beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}