{
  "kind": "build_request",
  "title": "Owner Admin Dashboard to View Sign-Ups",
  "projectName": "Blue Panthers Sign-Up",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend query function that returns all sign-up records stored in the map, including each player's ID, name, email, phone, age, position, and experience level.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "make a page for the owner of the app which is me to see who signed up for the blue panthers"
        ]
      },
      "acceptanceCriteria": [
        "A public query function (e.g., getAllSignUps) returns an array of all stored sign-up entries.",
        "Each entry includes: ID, name, email, phone, age, position, and experience level.",
        "The function returns an empty array when no sign-ups exist."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a React Query hook in useQueries.ts to fetch all sign-ups from the backend using the new getAllSignUps query function.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "make a page for the owner of the app which is me to see who signed up for the blue panthers"
        ]
      },
      "acceptanceCriteria": [
        "A useGetAllSignUps hook exists that calls the backend getAllSignUps function.",
        "The hook uses React Query and returns data, loading, and error states."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Create an Owner Dashboard page (frontend/src/pages/OwnerDashboard.tsx) that requires Internet Identity login to access. Once authenticated, display a table of all sign-ups showing each player's name, email, phone, age, position, and experience level. If not logged in, show a login prompt with an Internet Identity sign-in button. Style the page consistently with the existing navy and gold Blue Panthers design system.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "make a page for the owner of the app which is me to see who signed up for the blue panthers"
        ]
      },
      "acceptanceCriteria": [
        "The page is accessible via a /owner route or similar.",
        "Unauthenticated users see a login prompt with an Internet Identity sign-in button.",
        "Authenticated users see a table listing all sign-ups with columns: Name, Email, Phone, Age, Position, Experience Level.",
        "An empty state message is shown when there are no sign-ups.",
        "A loading indicator is shown while data is being fetched.",
        "The page uses the existing navy and gold color palette and Barlow font."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a navigation link or route in App.tsx so the Owner Dashboard page is reachable (e.g., via a discreet 'Owner Login' link in the footer or header).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "make a page for the owner of the app which is me to see who signed up for the blue panthers"
        ]
      },
      "acceptanceCriteria": [
        "A link to the Owner Dashboard exists in the app UI (footer or header).",
        "Clicking the link navigates to the Owner Dashboard page.",
        "The link is styled subtly so it does not distract public visitors."
      ]
    }
  ],
  "constraints": [
    "The Owner Dashboard must use Internet Identity authentication via the existing useInternetIdentity hook — do not implement any other auth mechanism.",
    "Do not modify files in frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All Motoko logic must remain in the single backend/main.mo actor file."
  ],
  "nonGoals": [
    "Role-based access control or multi-owner support.",
    "Ability to delete or edit sign-up records from the dashboard.",
    "Email notifications or export functionality.",
    "Any external authentication provider beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}