{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Owner Admin Dashboard to View Sign-Ups",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add React Query hook to fetch all sign-ups from the backend",
      "acceptanceCriteria": [
        "A useGetAllSignUps hook exists that calls the backend getAllSignUps function.",
        "The hook uses React Query and returns data, loading, and error states."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useGetAllSignUps hook that uses React Query to fetch all sign-up records from the backend getAllSignUps function. Follow the existing pattern in this file, using useActor to get the actor instance and useQuery with a queryKey of ['allSignUps']. Return data, isLoading, isError, and error states."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create Owner Dashboard page with Internet Identity authentication displaying all sign-ups in a table",
      "acceptanceCriteria": [
        "The page is accessible via a /owner route or similar.",
        "Unauthenticated users see a login prompt with an Internet Identity sign-in button.",
        "Authenticated users see a table listing all sign-ups with columns: Name, Email, Phone, Age, Position, Experience Level.",
        "An empty state message is shown when there are no sign-ups.",
        "A loading indicator is shown while data is being fetched.",
        "The page uses the existing navy and gold color palette and Barlow font."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OwnerDashboard.tsx",
          "operation": "create",
          "description": "Create an Owner Dashboard page component that requires Internet Identity authentication to view sign-up records. Use the authorization component to verify admin access via useInternetIdentity hook and display a login prompt with Internet Identity sign-in button for unauthenticated users. Once authenticated, use the useGetAllSignUps hook from REQ-2 to fetch and display all sign-ups in a responsive table with columns for Name, Email, Phone, Age, Position, and Experience Level. Show a loading spinner while fetching data and an empty state message when no sign-ups exist. Style consistently with the navy and gold Blue Panthers design system using Tailwind classes that reference the existing OKLCH color tokens (--color-navy-*, --color-gold-*) and Barlow font family. Include a logout button for authenticated users."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Wire Owner Dashboard page into the app navigation",
      "acceptanceCriteria": [
        "A link to the Owner Dashboard exists in the app UI (footer or header).",
        "Clicking the link navigates to the Owner Dashboard page.",
        "The link is styled subtly so it does not distract public visitors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import OwnerDashboard page component and add routing support for the /owner path. Install and configure react-router-dom if not already present, wrapping the app content in a BrowserRouter and using Routes/Route components to handle both the root path (SignUpPage) and /owner path (OwnerDashboard)."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add a subtle 'Owner Login' link in the footer that navigates to /owner route. Style the link discreetly using text-navy-400/50 or similar muted color so it blends into the footer and does not distract public visitors. Position it near the caffeine.ai attribution or as a separate small text element."
        }
      ]
    }
  ]
}